In [7]:
# 1. cctv_seoul.csv 파일 내용을 읽어서 인구수 대비 CCTV수와 인구수 대비 고령자 비율을 계산하여 각각 CCTV비율과 노인비율이라는 열을 추가하고 앞에서 부터 5개 행을 출력한다. 
# CCTV비율과 노인비율 추가시 apply() 함수를 사용해서 추가한다.
import pandas as pd

df = pd.read_csv("data/cctv_seoul.csv")

def rating(a, b):
    return (a / b)*100

df["CCTV비율"] = df.apply(lambda x: rating(x["CCTV수"], x["인구수"]), axis = 1)
df["노인비율"] = df.apply(lambda x: rating(x["고령자"], x["인구수"]), axis = 1)


display(df.head())

    구별  CCTV수       인구수       한국인      외국인      고령자    CCTV비율       노인비율
0  강남구   2780  570500.0  565550.0   4950.0  63167.0  0.487292  11.072217
1  강동구    773  453233.0  449019.0   4214.0  54622.0  0.170552  12.051638
2  강북구    748  330192.0  326686.0   3506.0  54813.0  0.226535  16.600342
3  강서구    884  603772.0  597248.0   6524.0  72548.0  0.146413  12.015794
4  관악구   1496  525515.0  507203.0  18312.0  68082.0  0.284673  12.955291

In [10]:
from matplotlib import font_manager, rc
font_path = "data/THEdog.ttf"   #폰트파일의 위치
font_name = font_manager.FontProperties(fname=font_path).get_name()
print(font_name)
rc('font', family=font_name)

import pandas as pd
import matplotlib.pyplot as plt
import matplotlib

THEGaeideuk

In [17]:
# 2-1. 상품별 클릭수를 바그래프로 그리는데 클릭수가 많은 순으로 그린다
df = pd.read_csv("data/product_click_new.log", header = None, sep = " ")

display(df)

                0     1
0    201612120944  p001
1    201612120944  p003
2    201612120944  p003
3    201612120945  p008
4    201612121052  p008
..            ...   ...
305  201612141110  p007
306  201612141111  p002
307  201612141139  p003
308  201612141139  p010
309  201612141139  p009

[310 rows x 2 columns]

In [24]:
# 3-1. 공된 emp.csv 를 읽고 데이터프레임으로 생성하여 다음 질문들을 해결해 본다.
# 부서별 월급의 합
df = pd.read_csv("data/emp.csv")
df1 = df.groupby(["deptno"])
display(df1.head())

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0  1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0  1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0  1981-02-03  1250   500.0      30
3    7566   JONES    MANAGER  7839.0  1981-03-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1981-10-22  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     NaN      30
6    7782   CLARK    MANAGER  7839.0  1981-09-06  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0  1982-12-08  3000     NaN      20
8    7839    KING  PRESIDENT     NaN  1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0  1984-10-08  1500     NaN      30
10   7876   ADAMS      CLERK  7788.0  1983-01-12  1100     NaN      20
12   7902    FORD    ANALYST  7566.0  1981-12-13  3000     NaN      20
13   7934  MILLER      CLERK  7782.0  1982-01-25  1300     NaN      10